Autodesk.Revit.DB.Structure.ZJustification
The justification of the framing element in Z.
Since:
2014
Since:
2014

Autodesk.Revit.DB.Structure.ZJustification.Bottom
Justification to the bottom of the element.

Autodesk.Revit.DB.Structure.ZJustification.Origin
Justification to the origin of the element.

Autodesk.Revit.DB.Structure.ZJustification.Center
Justification to the geometrical center of element.

Autodesk.Revit.DB.Structure.ZJustification.Top
Justification to the top of the element.